In [7]:
import pandas as pd

In [8]:
# 1) Crie uma série com os números de 1 a 5.

In [9]:
series = pd.Series([1, 2, 4, 8, 16]);
series

0     1
1     2
2     4
3     8
4    16
dtype: int64

In [ ]:
# 2) Crie uma série com os dias da semana como índices e as temperaturas correspondentes como valores

In [13]:
temperaturas = pd.Series(
    [22, 30, 26, 28, 18, 16, 20],
    index=['Domingo', 'Segunda', 'Terça', 'Quarta', 'Quinta', 'Sexta', 'Sábado']
)
temperaturas.name = 'Temperaturas (°C)'
temperaturas

Domingo    22
Segunda    30
Terça      26
Quarta     28
Quinta     18
Sexta      16
Sábado     20
Name: Temperaturas (°C), dtype: int64

In [2]:
# 3) Neste exercício, vamos praticar a indexação e seleção de elementos em uma série.

# a) Selecione o terceiro elemento da série criada no Exercício 01.

# b) Selecione todos os elementos de uma série que sejam maiores que 10. Supondo
# que temos uma série chamada 'serie_valores' que contém os valores ([5, 15, 8,
# 20, 10]).

# c) Selecione todos os elementos de uma série com índices entre 'b' e 'e'. Vamos
# supor que temos uma série chamada 'serie_letras', sendo: serie_letras =
# pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']).

In [15]:
# a
series[2]

4

In [18]:
# b
seriesMaior10 = series[series > 10]
seriesMaior10

4    16
dtype: int64

In [20]:
# c
novaSerie = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
valoresSelecionados = novaSerie.loc['b':'e']
valoresSelecionados

b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
# 4) Neste exercício, vamos realizar algumas operações básicas com séries.

# a) Some duas séries de números. Vamos supor que temos duas séries chamadas
# 'serie1' e 'serie2'. Sendo elas, respectivamente, ([1, 2, 3, 4]) e ([5, 6, 7, 8]).

# b) Multiplique uma série pelo número escalar 2. Vamos supor que temos uma série
# chamada 'serie_numeros', sendo a série ([1, 2, 3, 4]).

# c) Calcule a média dos elementos de uma série. Vamos supor que temos uma série
# chamada 'serie_valores', onde: serie_valores = pd.Series([10, 20, 30, 40])

In [23]:
#a
serie1 = pd.Series([1, 2, 3, 4])
serie2 = pd.Series([5, 6, 7, 8])
serieSoma = serie1 + serie2
serieSoma

0     6
1     8
2    10
3    12
dtype: int64

In [24]:
#b
serieMult2 = serie1 * 2
serieMult2

0    2
1    4
2    6
3    8
dtype: int64

In [27]:
serie_valores = pd.Series([10, 20, 30, 40])
serieMedia = serie_valores.mean()
print("A média da série é: ", serieMedia)

A média da série é:  25.0

In [28]:
# 5) Neste exercício, vamos praticar algumas operações de manipulação de dados em
# séries.

# a) Adicione um novo elemento a uma série existente. Vamos supor que temos uma
# série chamada 'serie_existente', sendo: serie_existente = pd.Series([1, 2, 3, 4],
# index=['a', 'b', 'c', 'd']).

# b) Remova um elemento de uma série. Vamos supor que temos uma série chamada
# 'serie_valores', sendo: serie_valores = pd.Series([10, 20, 30, 40], index=['a', 'b',
# 'c', 'd']).

# c) Altere o valor de um elemento específico em uma série. Vamos supor que temos
# uma série chamada 'serie_numeros', sendo: serie_numeros = pd.Series([1, 2, 3,
# 4], index=['a', 'b', 'c', 'd']).

In [29]:
#a
serie_existente = pd.Series(
    [1, 2, 3, 4],
    index=['a', 'b', 'c', 'd']
    )
serie_existente['e'] = 5
serie_existente

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [31]:
#b
serie_existente = serie_existente.drop('b')
serie_existente

a    1
c    3
d    4
e    5
dtype: int64

In [32]:
#c
serie_existente['a'] = 10
serie_existente

a    10
c     3
d     4
e     5
dtype: int64

In [5]:
# 6) Neste exercício, vamos explorar alguns métodos e funções úteis para manipular
# séries.

# a) Encontre os valores únicos em uma série. Vamos supor que temos uma série
# chamada 'serie_duplicada', sendo: serie_duplicada = pd.Series([1, 2, 2, 3, 3, 4, 4]).

# b) Verifique se um valor está presente em uma série. Vamos supor que temos uma
# série chamada 'serie_numeros', sendo: serie_numeros = pd.Series([1, 2, 3, 4, 5]).

# c) Ordene os elementos de uma série em ordem crescente. Vamos supor que temos
# uma série chamada 'serie_desordenada', sendo: serie_desordenada =
# pd.Series([3, 1, 4, 2, 5]).

In [33]:
#a
serie_duplicada = pd.Series([1, 2, 2, 3, 3, 4, 4])
valoresUnicos = serie_duplicada.unique()
valoresUnicos

array([1, 2, 3, 4])

In [34]:
#b
serie_numeros = pd.Series([1,2,3,4,5])
valorPresente = 6 in serie_numeros
valorPresente

False

In [36]:
#c
serie_desordenada = pd.Series([3, 1, 4, 2, 5])
serie_ordenada = serie_desordenada.sort_values()
serie_ordenada

1    1
3    2
0    3
2    4
4    5
dtype: int64

In [6]:
# 7) Neste exercício, vamos explorar como manipular os índices de uma série.

# a) Renomeie os índices de uma série. Vamos supor que temos uma série chamada
# 'serie_valores' com índices ['a', 'b', 'c', 'd'].

# b) Reset os índices de uma série. Vamos supor que temos uma série chamada
# 'serie_com_indices', sendo: serie_com_indices = pd.Series([10, 20, 30, 40], index=['a',
# 'b', 'c', 'd']).

In [42]:
#a
serie_valores = pd.Series([5, 10, 15, 20], index=['a', 'b', 'c', 'd'])
serie_valores.index = ['e', 'f', 'g', 'h']
serie_valores

e     5
f    10
g    15
h    20
dtype: int64

In [43]:
#b
serie_valores = serie_valores.reset_index(drop=True)
serie_valores

0     5
1    10
2    15
3    20
dtype: int64

In [ ]:
# 8) Neste exercício, vamos explorar como lidar com dados faltantes (NaN) em séries.

# a) Crie uma série com valores ausentes (NaN), sendo: ([1, 2, np.nan, 4, np.nan]).

# b) Remova os valores ausentes da série anterior.

# c) Preencha os valores ausentes com o valor zero.

In [44]:
import numpy as np

In [45]:
#a
serie_exemplo = pd.Series([1, 2, np.nan, 4, np.nan])
serie_exemplo

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [46]:
#b
serieSemNan = serie_exemplo.dropna()
serieSemNan

0    1.0
1    2.0
3    4.0
dtype: float64

In [47]:
#c
serieNanZero = serie_exemplo.fillna(0);
serieNanZero

0    1.0
1    2.0
2    0.0
3    4.0
4    0.0
dtype: float64